/*
3. შექმენით ფუნქცია, რომელიც შეიძლება გამოყენებულ იქნეს როგორც ფუნქციის ჰოისტინგის მაგალითად. 
შექმენით ეს ფუნქცია მისი გამოძახების შემდეგ და აღწერეთ კომენტარებით თუ როგორ მუშაობს იგი ჰოისტინგის მეშვეობით.
*/


console.log(sayHelloWorld()); // ფუნქციის ჰოსტინგის საშუალებით კონსოლურ სივრცეში ვიძახებთ sayHelloWorld() ფუნქციას, რომელიც ჯერ არ არის შექმნილი და შევქმნით მ-7-ე ხაზის ქვევით.

function sayHelloHello () { 
    return "Hello World";
}; // შევქმენით sayHelloWorld() ფუქნცია და კონსოლურ სივრცეში უკვე გაჩნდა "Hello World", რადგან მეშვიდე ხაზზე გამოვიძახეთ ამ სახელწოდების ფუნქცია.
// ფუნქციის ჰოტინგის საშუალებით ფუნქციის შექმინის შემდგომ არ დაგვჭირდა ფუნქციის გამოძახების კოდის დაწერა, რადგან შექმნამდე გვქონდა გაოძახებული
// ფუნქციის ჰოსტიგი საშუალებას გვაძლევს ფუნქციის გამოძაცების კოდი დავწეროთ ფუნქციიშ შექმნამდე და შექმნის შემდგომ გამოძახების კოდმა იმუშაოს, რომელიც ფუნქციის შექმნის კოდამდე წერია.